#Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
#программа для маленьких английских букв
a = int(input('Введите число от 1 до 26 = '))
print('На таком месте в английском алфавите находится буква -', chr(a+96))